#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod]
time_sleep.wait_rg: Refreshing state... [id=2025-09-17T14:31:47Z]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod]
time_sleep.wait_vnet: Refreshing state... [id=2025-09-17T14:32:22Z]
module.subnets.azurerm_subnet.db: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/db-subnet]
module.subnets.azurerm_subnet.app: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/app-subnet]
module.subnets.azurerm_subnet.mgmt: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/mgmt-subnet]
module.subnets.azurerm_public_ip_prefix.nat: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/publicIPPrefixes/quotesapp-pipprefix]
module.subnets.azurerm_nat_gateway.nat: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/natGateways/quotesapp-nat]
module.subnets.azurerm_subnet.pe: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/pe-subnet]
module.subnets.azurerm_subnet.web: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/web-subnet]
module.subnets.azurerm_network_security_group.web_nsg: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/networkSecurityGroups/web-nsg]
module.subnets.azurerm_subnet_network_security_group_association.web_association: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/web-subnet]
module.subnets.time_sleep.wait_nat: Refreshing state... [id=2025-09-17T14:33:04Z]
module.subnets.azurerm_nat_gateway_public_ip_prefix_association.nat: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/natGateways/quotesapp-nat|/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/publicIPPrefixes/quotesapp-pipprefix]
module.subnets.azurerm_subnet_nat_gateway_association.app_nat: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/app-subnet]
module.sql.data.azurerm_key_vault.key_vault: Reading...
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.ContainerRegistry/registries/quotesappacrprod]
module.sql.azurerm_private_dns_zone.sql_dns: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net]
module.acr.azurerm_private_dns_zone.acr_dns: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io]
module.sql.data.azurerm_key_vault.key_vault: Read complete after 0s [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv]
module.sql.data.azurerm_key_vault_secret.sql_admin_login: Reading...
module.sql.data.azurerm_key_vault_secret.sql_admin_password: Reading...
module.sql.azurerm_private_dns_zone_virtual_network_link.sql_dns_link: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net/virtualNetworkLinks/sql-dns-link-quotesapp]
module.sql.data.azurerm_key_vault_secret.sql_admin_password: Read complete after 0s [id=https://quotesappprodkv.vault.azure.net/secrets/SQL-QUOTES-APP-PROD-ADMIN-PASSWORD/536547480bbd40e08008a44045e54c5e]
module.sql.data.azurerm_key_vault_secret.sql_admin_login: Read complete after 0s [id=https://quotesappprodkv.vault.azure.net/secrets/SQL-QUOTES-APP-PROD-ADMIN-LOGIN/d90a620fbb7a4e2a87fc835b5dd0b82c]
module.sql.azurerm_mssql_server.sql_server: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Sql/servers/sqlserver-quotesapp-prod]
module.acr.azurerm_private_dns_zone_virtual_network_link.acr_dns_link: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/virtualNetworkLinks/acr-dns-link-quotesapp]
module.acr.azurerm_private_endpoint.acr_pe: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/acr-pe-quotesapp]
module.sql.time_sleep.wait_for_sql: Refreshing state... [id=2025-09-17T14:37:17Z]
module.sql.azurerm_private_endpoint.sql_pe: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/sql-pe-quotesapp]
module.sql.azurerm_mssql_database.sql_database: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Sql/servers/sqlserver-quotesapp-prod/databases/sqldb-quotesapp-prod]
module.app_service.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Web/serverFarms/service-plan-quotesapp-prod]
module.app_service.azurerm_private_dns_zone.appservice_dns: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net]
module.app_service.azurerm_linux_web_app.webapp: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Web/sites/webapp-quotesapp-prod]
module.app_service.azurerm_private_dns_zone_virtual_network_link.appservice_dns_link: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net/virtualNetworkLinks/app-dns-link-quotesapp]
module.app_service.azurerm_role_assignment.acr_pull: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.ContainerRegistry/registries/quotesappacrprod/providers/Microsoft.Authorization/roleAssignments/a8fe7f94-2289-b80b-f045-87edbfa7ea73]
module.app_service.azurerm_private_endpoint.app_pe: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/app-pe-quotesapp]
module.certificate.azurerm_key_vault_certificate.ssl_cert: Refreshing state... [id=https://quotesappprodkv.vault.azure.net/certificates/cert-appgateway-quotesapp/61d5f9c9e3c74105a6d45a3ee7189568]
module.application_gateway.azurerm_user_assigned_identity.appgw_identity: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.ManagedIdentity/userAssignedIdentities/appgw_identity_quotesapp]
module.application_gateway.azurerm_public_ip.pip: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/publicIPAddresses/pip-appgateway-quotesapp]
module.application_gateway.azurerm_role_assignment.appgw_kv_secret_access: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv/providers/Microsoft.Authorization/roleAssignments/29efa9b9-1bbf-b0c0-ced5-813683146495]
module.application_gateway.azurerm_application_gateway.application_gateway: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/applicationGateways/appgateway-quotesapp]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.app_service.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = (sensitive value)
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = (sensitive value)
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.app_service.data.azurerm_key_vault_secret.db_user_login will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "db_user_login" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SQL-QUOTES-APP-PROD-DB-USER-LOGIN"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.app_service.data.azurerm_key_vault_secret.db_user_password will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "db_user_password" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SQL-QUOTES-APP-PROD-DB-USER-PASSWORD"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.app_service.azurerm_linux_web_app.webapp will be updated in-place
  ~ resource "azurerm_linux_web_app" "webapp" {
      ~ app_settings                                   = {
          - "DB_HOST"       = "sqlserver-quotesapp-prod.database.windows.net"
          - "DB_NAME"       = "sqldb-quotesapp-prod"
          - "DB_PASS"       = (sensitive value)
          - "DB_PORT"       = "1433"
          - "DB_USER"       = (sensitive value)
          - "NODE_ENV"      = "production"
          - "WEBSITES_PORT" = "8080"
        } -> (known after apply)
        id                                             = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Web/sites/webapp-quotesapp-prod"
        name                                           = "webapp-quotesapp-prod"
        tags                                           = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (26 unchanged attributes hidden)

      - logs {
          - detailed_error_messages = false -> null
          - failed_request_tracing  = false -> null

          - http_logs {
              - file_system {
                  - retention_in_days = 0 -> null
                  - retention_in_mb   = 35 -> null
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.application_gateway.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.application_gateway.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "quotesappprodkv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "terraform-backend-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.application_gateway.azurerm_application_gateway.application_gateway will be updated in-place
  ~ resource "azurerm_application_gateway" "application_gateway" {
        id                                = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/applicationGateways/appgateway-quotesapp"
        name                              = "appgateway-quotesapp"
        tags                              = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (8 unchanged attributes hidden)

      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (11 unchanged blocks hidden)
    }

  # module.application_gateway.azurerm_role_assignment.appgw_kv_secret_access must be replaced
-/+ resource "azurerm_role_assignment" "appgw_kv_secret_access" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv/providers/Microsoft.Authorization/roleAssignments/29efa9b9-1bbf-b0c0-ced5-813683146495" -> (known after apply)
      ~ name                                   = "29efa9b9-1bbf-b0c0-ced5-813683146495" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      ~ scope                                  = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.certificate.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "quotesappprodkv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "terraform-backend-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.certificate.azurerm_key_vault_certificate.ssl_cert must be replaced
-/+ resource "azurerm_key_vault_certificate" "ssl_cert" {
      ~ certificate_attribute           = [
          - {
              - created        = "2025-09-17T14:42:28Z"
              - enabled        = true
              - expires        = "2026-09-17T14:42:28Z"
              - not_before     = "2025-09-17T14:32:28Z"
              - recovery_level = "CustomizedRecoverable+Purgeable"
              - updated        = "2025-09-17T14:42:28Z"
            },
        ] -> (known after apply)
      ~ certificate_data                = "3082037C30820264A0030201020210693729E46F954C2DAF457C946FDC3FE4300D06092A864886F70D01010B0500303031123010060355040A1309526168756C204F7267311A3018060355040313116170702E71756F7465736170702E636F6D301E170D3235303931373134333232385A170D3236303931373134343232385A303031123010060355040A1309526168756C204F7267311A3018060355040313116170702E71756F7465736170702E636F6D30820122300D06092A864886F70D01010105000382010F003082010A0282010100CFC6D73F7A7A77C42A813D061ACECAD1CFED307EA1676DDAAFF8709CC1BC237E51406EC661DD41F5DC81B1F50877A4B256EE8A37F61DED8767FF17C587977E040426F0E0805AA23CAB3D394D86B4322DF99E93B5320CFD4B9DE8E162D8AF71790EADED9A12260773A0EC4CA102B8B5A73A513B67DB619491978B601382DF4162514C2FB7F139444FBC654208FCF6AF4C71EF5C31CF5297D02B1C675B6777F37E2D0AB4886A5BEE0D791FC98B2124A5E04D46ABA0EE156FBABEF615143DE242D140D1FD66E4E419C4FFC270D1CDCDC5B25B6E6E4517EBCD9CE0BC7D8F25B66EE04D761CE9871F7C4AF9E94CB7802AA980513FF4F1F5A02EF14263B9AC3DB1F2A50203010001A3819130818E300E0603551D0F0101FF0404030205A030090603551D130402300030130603551D25040C300A06082B06010505070301301C0603551D110415301382116170702E71756F7465736170702E636F6D301F0603551D23041830168014F7E2A3599A9DBF4AFCFC169824C6DF921217117C301D0603551D0E04160414F7E2A3599A9DBF4AFCFC169824C6DF921217117C300D06092A864886F70D01010B050003820101009750491987DD580376C7B7A069BA6F3E7382B9B06A040243DC188F16E978D601FD1177BEC1819DE72C45B27C71CD64EA74F1DC32AA8E95E6B80DF08329C87B19CDDFCB90F94456C49C1E2478F1A172DB3F37D00E81CEA9CDAC8FB9D50ABA8E0733AF3F461BFC48E03B31033328B7C29DD5B80315568AD1CDF9B2EAFB6450AD4204121E135CA1EC1551D4F48A948356D8190F355E53C6BB8864D33C102A8FD5F087A2CBAB9369B925ACBC717CB4A573AC0E90799AAADB45663EC1EEC1F73D37EBC1E6548CBF3AF9083DEE4A54474C3AA1ECEC2D595849FEC1FE650099F13FBA7E83EA95A6DCB35841F3A21619B1BF05EBC39B24961C778BE902197E35B6E52008" -> (known after apply)
      ~ certificate_data_base64         = "MIIDfDCCAmSgAwIBAgIQaTcp5G+VTC2vRXyUb9w/5DANBgkqhkiG9w0BAQsFADAwMRIwEAYDVQQKEwlSYWh1bCBPcmcxGjAYBgNVBAMTEWFwcC5xdW90ZXNhcHAuY29tMB4XDTI1MDkxNzE0MzIyOFoXDTI2MDkxNzE0NDIyOFowMDESMBAGA1UEChMJUmFodWwgT3JnMRowGAYDVQQDExFhcHAucXVvdGVzYXBwLmNvbTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAM/G1z96enfEKoE9BhrOytHP7TB+oWdt2q/4cJzBvCN+UUBuxmHdQfXcgbH1CHekslbuijf2He2HZ/8XxYeXfgQEJvDggFqiPKs9OU2GtDIt+Z6TtTIM/Uud6OFi2K9xeQ6t7ZoSJgdzoOxMoQK4tac6UTtn22GUkZeLYBOC30FiUUwvt/E5RE+8ZUII/PavTHHvXDHPUpfQKxxnW2d3834tCrSIalvuDXkfyYshJKXgTUaroO4Vb7q+9hUUPeJC0UDR/Wbk5BnE/8Jw0c3NxbJbbm5FF+vNnOC8fY8ltm7gTXYc6YcffEr56Uy3gCqpgFE/9PH1oC7xQmO5rD2x8qUCAwEAAaOBkTCBjjAOBgNVHQ8BAf8EBAMCBaAwCQYDVR0TBAIwADATBgNVHSUEDDAKBggrBgEFBQcDATAcBgNVHREEFTATghFhcHAucXVvdGVzYXBwLmNvbTAfBgNVHSMEGDAWgBT34qNZmp2/Svz8Fpgkxt+SEhcRfDAdBgNVHQ4EFgQU9+KjWZqdv0r8/BaYJMbfkhIXEXwwDQYJKoZIhvcNAQELBQADggEBAJdQSRmH3VgDdse3oGm6bz5zgrmwagQCQ9wYjxbpeNYB/RF3vsGBnecsRbJ8cc1k6nTx3DKqjpXmuA3wgynIexnN38uQ+URWxJweJHjxoXLbPzfQDoHOqc2sj7nVCrqOBzOvP0Yb/EjgOzEDMyi3wp3VuAMVVorRzfmy6vtkUK1CBBIeE1yh7BVR1PSKlINW2BkPNV5TxruIZNM8ECqP1fCHosurk2m5Jay8cXy0pXOsDpB5mqrbRWY+we7B9z0368HmVIy/OvkIPe5KVEdMOqHs7C1ZWEn+wf5lAJnxP7p+g+qVptyzWEHzohYZsb8F68ObJJYcd4vpAhl+NbblIAg=" -> (known after apply)
      ~ id                              = "https://quotesappprodkv.vault.azure.net/certificates/cert-appgateway-quotesapp/61d5f9c9e3c74105a6d45a3ee7189568" -> (known after apply)
      ~ key_vault_id                    = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv" -> (known after apply) # forces replacement
        name                            = "cert-appgateway-quotesapp"
      ~ resource_manager_id             = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv/certificates/cert-appgateway-quotesapp/versions/61d5f9c9e3c74105a6d45a3ee7189568" -> (known after apply)
      ~ resource_manager_versionless_id = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv/certificates/cert-appgateway-quotesapp" -> (known after apply)
      ~ secret_id                       = "https://quotesappprodkv.vault.azure.net/secrets/cert-appgateway-quotesapp/61d5f9c9e3c74105a6d45a3ee7189568" -> (known after apply)
        tags                            = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
      ~ thumbprint                      = "B7ACDD5498CE78A3066B37BAB26BC91785847DF6" -> (known after apply)
      ~ version                         = "61d5f9c9e3c74105a6d45a3ee7189568" -> (known after apply)
      ~ versionless_id                  = "https://quotesappprodkv.vault.azure.net/certificates/cert-appgateway-quotesapp" -> (known after apply)
      ~ versionless_secret_id           = "https://quotesappprodkv.vault.azure.net/secrets/cert-appgateway-quotesapp" -> (known after apply)

      ~ certificate_policy {
          ~ key_properties {
              + curve      = (known after apply)
                # (4 unchanged attributes hidden)
            }
          ~ lifetime_action {
              ~ trigger {
                  - lifetime_percentage = 0 -> null
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ x509_certificate_properties {
              ~ subject            = "CN=app.quotesapp.com, O=Rahul Org" -> "CN=app.quotesapp.com, O=Our Org"
                # (3 unchanged attributes hidden)

              ~ subject_alternative_names {
                  - emails    = [] -> null
                  - upns      = [] -> null
                    # (1 unchanged attribute hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.sql.azurerm_mssql_server.sql_server will be updated in-place
  ~ resource "azurerm_mssql_server" "sql_server" {
        id                                           = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Sql/servers/sqlserver-quotesapp-prod"
        name                                         = "sqlserver-quotesapp-prod"
      ~ public_network_access_enabled                = true -> false
        tags                                         = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (15 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @nagarajurahul, Action: `pull_request`*